## This workbook contains notes for connecting directly to a local SQLite Database

For this section, you'll need to download portal_mammals.sqlite from https://figshare.com/articles/Portal_Project_Teaching_Database/1314459

In [48]:
import sqlite3

In [49]:
conn = sqlite3.connect("data/portal_mammals.sqlite")
c = conn.cursor()

In [50]:
### reading into rows

In [51]:
for row in c.execute('SELECT * FROM species LIMIT 5'):
    print(row, ':', row[0])

('AB', 'Amphispiza', 'bilineata', 'Bird') : AB
('AH', 'Ammospermophilus', 'harrisi', 'Rodent') : AH
('AS', 'Ammodramus', 'savannarum', 'Bird') : AS
('BA', 'Baiomys', 'taylori', 'Rodent') : BA
('CB', 'Campylorhynchus', 'brunneicapillus', 'Bird') : CB

In [52]:
# working with pandas dataframes
import pandas as pd

In [60]:
df_species = pd.read_sql_query("SELECT species.taxa, surveys.hindfoot_length \
          FROM species \
          JOIN surveys \
          ON species.species_id = surveys.species_id", conn)

In [61]:
df_species

          taxa  hindfoot_length
0         Bird              NaN
1         Bird              NaN
2         Bird              NaN
3         Bird              NaN
4         Bird              NaN
5         Bird              NaN
6         Bird              NaN
7         Bird              NaN
8         Bird              NaN
9         Bird              NaN
10        Bird              NaN
11        Bird              NaN
12        Bird              NaN
13        Bird              NaN
14        Bird              NaN
15        Bird              NaN
16        Bird              NaN
17        Bird              NaN
18        Bird              NaN
19        Bird              NaN
20        Bird              NaN
21        Bird              NaN
22        Bird              NaN
23        Bird              NaN
24        Bird              NaN
25        Bird              NaN
26        Bird              NaN
27        Bird              NaN
28        Bird              NaN
29        Bird              NaN
...        ...              ...
34756  Reptile              NaN
34757  Reptile              NaN
34758  Reptile              NaN
34759  Reptile              NaN
34760  Reptile              NaN
34761  Reptile              NaN
34762     Bird              NaN
34763     Bird              NaN
34764     Bird              NaN
34765     Bird              NaN
34766     Bird              NaN
34767     Bird              NaN
34768     Bird              NaN
34769     Bird              NaN
34770   Rodent              NaN
34771   Rodent              NaN
34772   Rodent              NaN
34773   Rodent              NaN
34774   Rodent              NaN
34775   Rodent              NaN
34776   Rodent              NaN
34777   Rodent              NaN
34778   Rodent              NaN
34779   Rodent              NaN
34780     Bird              NaN
34781     Bird              NaN
34782     Bird              NaN
34783     Bird              NaN
34784     Bird              NaN
34785     Bird              NaN

[34786 rows x 2 columns]

In [37]:
df_species.set_index('species_id',inplace=True)

In [46]:
#list(df_species.index)

In [44]:
df_species.loc['AB']

genus      Amphispiza
species     bilineata
taxa             Bird
Name: AB, dtype: object

In [45]:
c.execute("CREATE VIEW taxa_hindfoot_view AS \
          SELECT species.taxa, surveys.hindfoot_length \
          FROM species \
          JOIN surveys \
          ON species.species_id = surveys.species_id")

In [47]:
c.execute("CREATE TABLE taxa_hindfoot AS \
    SELECT species.taxa, surveys.hindfoot_length \
    FROM species \
    JOIN surveys \
    ON species.species_id = surveys.species_id")

OperationalError: table taxa_hindfoot already exists